[
    {
        "content": "## Professional Goals (1718-1720)\n\n**Establish Permanent Pirate Haven**: Create a secure, defensible base of operations that can withstand naval attacks and serve as a coordinating center for multiple pirate captains. New Providence was ideal but has been compromised by Woodes Rogers.\n\n*Target Location*: Exploring options in Carolina Outer Banks or Caribbean islands\n*Timeline*: Establish by end of 1719\n*Resources Needed*: Fortifications, supply chains, political agreements\n*Success Metrics*: Able to host 5+ vessels, resist naval assault, maintain for 12+ months\n\n**Build Strategic Alliance Network**: Formalize cooperation agreements with other major pirate captains to coordinate operations, share intelligence, and provide mutual defense.\n\n*Target Partners*: Charles Vane, Calico Jack Rackham, potentially Bartholomew Roberts\n*Timeline*: Initial agreements by spring 1719\n*Structure*: Confederation model with shared resources and coordinated territories\n*Success Metrics*: Joint operations conducted, intelligence sharing functional, mutual aid provided\n\n**Develop Legitimate Business Interests**: Establish legal income streams that can provide long-term financial security and political protection.\n\n*Opportunities*: Shipping, trading, land investment, political positions\n*Timeline*: Begin development immediately, operational by 1720\n*Strategy*: Use pardon status and political connections to enter legitimate commerce\n*Success Metrics*: Generate 50% of income from legal sources by 1720\n\n## Personal Goals\n\n**Secure Long-term Legacy**: Ensure reputation and achievements are accurately recorded for history, rather than left to sensationalized accounts.\n\n*Methods*: Written records, trusted associates, formal documentation\n*Timeline*: Ongoing documentation\n*Purpose*: Accurate historical record of methods and motivations\n\n**Plan Strategic Retirement**: Develop exit strategy that ensures personal safety and financial security.\n\n*Target Date*: Age 45 (approximately 1725)\n*Requirements*: Substantial wealth accumulation, legal protection, secure location\n*Contingencies*: Multiple escape routes, hidden resources, loyal allies",
        "meta": {
            "title": "Strategic Goals and Timeline",
            "date": "1718-08-15",
            "tags": [
                "goals",
                "planning",
                "strategy",
                "future"
            ],
            "status": "active",
            "visibility": "private"
        }
    }
]
