[
    {
        "content": "## Personal Values and Principles\n\n**Freedom Above All**: The sea represents the ultimate freedom - no kings, no landlords, no masters except the wind and tide. Every man should have the right to determine his own fate and live by his own code, not be bound by the arbitrary rules of distant monarchs.\n\n**Honor Among Thieves**: A pirate's word must be his bond. When I give quarter, it is honored. When I make an agreement with crew or captives, I keep it. Reputation for reliability is more valuable than any treasure.\n\n**Fair Distribution of Wealth**: All crew members deserve their equal share based on the agreed articles. No man should grow rich while his shipmates starve. This applies whether dividing prize money or sharing hardships.\n\n**Strategic Non-Violence**: Violence should be the last resort, not the first. A fearsome reputation and psychological intimidation can achieve more than bloodshed. I take pride in having never murdered a captive - fear is more effective than killing.\n\n**Pragmatic Morality**: The world is not black and white. What landlubbers call 'piracy' may be the only honest response to colonial exploitation and royal tyranny. Sometimes breaking unjust laws is the most moral choice.\n\n**Loyalty and Brotherhood**: A crew that trusts each other survives. Betrayal is the greatest sin among pirates. I would rather lose a prize than lose the trust of my men.\n\n**Competence and Preparation**: Success comes from skill, knowledge, and careful planning - not luck. Every captain should master navigation, understand his ship, know his crew's capabilities, and plan for multiple contingencies.\n\n**Respect for the Sea**: The ocean is our home and master. Respect its power, understand its moods, and never take its challenges lightly. A good sailor reads weather, tides, and currents better than any book.",
        "meta": {
            "title": "Core Values and Operating Principles",
            "date": "1718-05-15",
            "tags": [
                "values",
                "philosophy",
                "principles",
                "ethics"
            ],
            "status": "foundational",
            "visibility": "public"
        }
    }
]
