[
    {
        "content": "### Core Values\n\n#### Curiosity\n**Principle:** Seek to understand before judging or reacting.\n\n**In Practice:**\n- Ask \"why\" and \"how\" before \"what\" or \"when\"\n- Approach disagreements with genuine interest in other perspectives\n- Allocate time for exploration and experimentation in work projects\n- Default to learning rather than being right\n\n**Example:** When a colleague proposes a solution I disagree with, I first try to understand their reasoning and constraints before offering alternatives.\n\n---\n\n#### Integrity\n**Principle:** Deliver on commitments and be transparent about limitations.\n\n**In Practice:**\n- Under-promise and over-deliver on project timelines\n- Admit when I don't know something rather than bluffing\n- Share credit generously and take responsibility for failures\n- Align actions with stated values, even when inconvenient\n\n**Example:** If I realize a project will take longer than estimated, I communicate early with stakeholders rather than hoping to catch up.\n\n---\n\n#### Impact\n**Principle:** Focus energy on work that meaningfully improves people's lives.\n\n**In Practice:**\n- Prioritize projects with clear human benefit over pure technical challenges\n- Measure success by outcomes for users, not just outputs\n- Choose sustainable solutions over quick fixes\n- Consider long-term consequences of technical decisions\n\n**Example:** When designing APIs, I prioritize developer experience and long-term maintainability over clever optimizations.\n\n---\n\n#### Growth\n**Principle:** Continuous learning and development for myself and others.\n\n**In Practice:**\n- Dedicate time to learning new technologies and methodologies\n- Seek feedback actively and receive it with gratitude\n- Teach and mentor others whenever possible\n- Embrace challenges that push beyond current comfort zones\n\n**Example:** I allocate 20% of my work time to learning projects, even when facing tight deadlines, because it ultimately makes me more effective.\n\n---\n\n#### Collaboration\n**Principle:** Achieve better outcomes through diverse perspectives and shared effort.\n\n**In Practice:**\n- Actively seek input from team members with different backgrounds\n- Create psychological safety for others to share dissenting opinions\n- Default to transparency in decision-making processes\n- Invest time in building relationships and trust\n\n**Example:** Before making major technical decisions, I organize inclusive discussions to gather insights from various stakeholders.\n\n---\n\n#### Simplicity\n**Principle:** Favor clear, simple solutions over complex ones.\n\n**In Practice:**\n- Choose boring, well-understood technologies over cutting-edge options\n- Write code that prioritizes readability over cleverness\n- Design systems that are easy to understand and maintain\n- Communicate in plain language rather than technical jargon\n\n**Example:** I often choose a simpler architecture that the whole team can understand over a more \"elegant\" solution that only I can maintain.",
        "meta": {
            "title": "Core Values",
            "date": "2025-08-28",
            "tags": [
                "values",
                "principles",
                "personal-philosophy",
                "character",
                "ethics"
            ],
            "status": "active",
            "visibility": "public"
        }
    }
]
